; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph1 - mode
	infrared0 - mode
	Star2 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star5 - direction
	Star3 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 infrared0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 Star5)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star3)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star3)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation9)
	(calibration_target instrument6 GroundStation8)
	(supports instrument7 spectrograph1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
)
(:goal (and
	(pointing satellite1 Planet12)
	(pointing satellite2 Phenomenon16)
	(pointing satellite3 Phenomenon10)
	(have_image Phenomenon10 spectrograph1)
	(have_image Star11 spectrograph1)
	(have_image Planet12 infrared0)
	(have_image Star13 spectrograph1)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 infrared0)
	(have_image Phenomenon16 spectrograph1)
	(have_image Star17 infrared0)
))

)

; plan
1. (turn_to satellite3 phenomenon10 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon10)
   goals met: 1 of 11
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 11
3. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 11
4. (turn_to satellite2 planet12 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 planet12)
   goals met: 1 of 11
5. (take_image satellite2 planet12 instrument4 infrared0)
   added: (have_image planet12 infrared0)
   goals met: 2 of 11
6. (turn_to satellite2 phenomenon15 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon15)
   goals met: 2 of 11
7. (take_image satellite2 phenomenon15 instrument4 infrared0)
   added: (have_image phenomenon15 infrared0)
   goals met: 3 of 11
8. (turn_to satellite2 phenomenon10 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 11
9. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 4 of 11
10. (take_image satellite2 phenomenon10 instrument4 spectrograph1)
   added: (have_image phenomenon10 spectrograph1)
   goals met: 5 of 11
11. (turn_to satellite2 planet14 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 planet14)
   goals met: 5 of 11
12. (take_image satellite2 planet14 instrument4 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 11
13. (turn_to satellite2 star11 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 star11)
   goals met: 6 of 11
14. (take_image satellite2 star11 instrument4 spectrograph1)
   added: (have_image star11 spectrograph1)
   goals met: 7 of 11
15. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 7 of 11
16. (take_image satellite2 star13 instrument4 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 8 of 11
17. (turn_to satellite2 star17 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star17)
   goals met: 8 of 11
18. (take_image satellite2 star17 instrument4 infrared0)
   added: (have_image star17 infrared0)
   goals met: 9 of 11
19. (turn_to satellite2 phenomenon16 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 phenomenon16)
   goals met: 10 of 11
20. (take_image satellite2 phenomenon16 instrument4 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 11 of 11
